app/views/scores/index.html.erb

    </tr>
    <% @scores.limit(10).order('score desc').each do |score| %>
---
SELECT  "scores".* FROM "scores"  ORDER BY score desc LIMIT 10