app/controllers/save_state_controller.rb

INSERT INTO "save_states" ("score", "difficulty", "bullets", "lives") VALUES (?, ?, ?, ?)  [["score", 1337], ["difficulty", "hard"], ["bullets", 27], ["lives", 2]]
---
  def create
    userDiff = params[:user_difficulty]
    userScore = params[:user_score]
    userBullets = params[:user_bullets]
    userLives = params[:user_lives]
    @save_state = SaveState.create(
      user_id: session[:user_id],
      score: userScore,
      difficulty: userDiff,
      bullets: userBullets,
      lives: userLives
      )